# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [26]:
#Importing required libraries

import numpy as np
import pandas as pd

Next, import `Orders` from the file `Oders.csv` located in the `data` folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [27]:
#Importing the database

orders = pd.read_csv("../data/Orders.csv")

orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [28]:
#Checking the different columns in the dataframe

orders.columns

Index(['Unnamed: 0', 'InvoiceNo', 'StockCode', 'year', 'month', 'day', 'hour',
       'Description', 'Quantity', 'InvoiceDate', 'UnitPrice', 'CustomerID',
       'Country', 'amount_spent'],
      dtype='object')

In [29]:
#Getting the max amount spent by a costumer and the Customer ID

orders[["CustomerID","amount_spent"]].sort_values(by="amount_spent")

        CustomerID  amount_spent
352746       15602          0.00
53788        17560          0.00
322279       12431          0.00
137127       12415          0.00
208950       14911          0.00
...            ...           ...
248706       17450       7144.72
118352       16029       8142.75
155418       15098      38970.00
37126        12346      77183.60
397451       16446     168469.60

[397924 rows x 2 columns]

In [30]:
#Finding the different countries in the dataset

orders["Country"].unique()

array(['United Kingdom', 'France', 'Australia', 'Netherlands', 'Germany',
       'Norway', 'EIRE', 'Switzerland', 'Spain', 'Poland', 'Portugal',
       'Italy', 'Belgium', 'Lithuania', 'Japan', 'Iceland',
       'Channel Islands', 'Denmark', 'Cyprus', 'Sweden', 'Finland',
       'Austria', 'Greece', 'Singapore', 'Lebanon',
       'United Arab Emirates', 'Israel', 'Saudi Arabia', 'Czech Republic',
       'Canada', 'Unspecified', 'Brazil', 'USA', 'European Community',
       'Bahrain', 'Malta', 'RSA'], dtype=object)

In [31]:
#Creating a new column and filling it with the quantiles of amount_spent and then labelling thesese rows as VIP and Prefered customers

orders["VIP"] = pd.qcut(orders["amount_spent"],q=20,labels=['p0','p5','p10','p15','p20','p25','p30','p35','p40','p45','p50','p55','p60','p65','p70','Prefered C 4','Prefered C 3','Prefered C 2','Prefered C 1','VIP C '])

In [32]:
#orders['Customer_type'] = pd.qcut(orders['amount_spent'],q = [0,0.75,0.95,1] , labels = ['Regular','Preferred','VIP'])

In [ ]:
#total_spent["Quantiles"]= pd.cut(total_spent["amount_spent"], 
                             #bins = [total_spent["amount_spent"].quantile(0.),total_spent["amount_spent"].quantile(.75),total_spent["amount_spent"].quantile(.95),total_spent["amount_spent"].quantile(1.)],
                             #labels=["Casual", "Preferred","VIP"])

In [43]:
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent,VIP
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30,p60
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,VIP+Prefered
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00,VIP+Prefered
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,VIP+Prefered
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,VIP+Prefered

In [34]:
#Displaying the results

orders[["CustomerID","Country","amount_spent","VIP"]].sort_values(by="amount_spent")

        CustomerID         Country  amount_spent     VIP
352746       15602  United Kingdom          0.00      p0
53788        17560  United Kingdom          0.00      p0
322279       12431       Australia          0.00      p0
137127       12415       Australia          0.00      p0
208950       14911            EIRE          0.00      p0
...            ...             ...           ...     ...
248706       17450  United Kingdom       7144.72  VIP C
118352       16029  United Kingdom       8142.75  VIP C
155418       15098  United Kingdom      38970.00  VIP C
37126        12346  United Kingdom      77183.60  VIP C
397451       16446  United Kingdom     168469.60  VIP C

[397924 rows x 4 columns]

In [35]:
#Displaying the results

orders[["Country","VIP"]].sort_values(by="VIP")

               Country     VIP
16181   United Kingdom      p0
387878  United Kingdom      p0
311537  United Kingdom      p0
27680   United Kingdom      p0
171151  United Kingdom      p0
...                ...     ...
380139  United Kingdom  VIP C
380138  United Kingdom  VIP C
380137  United Kingdom  VIP C
380146         Germany  VIP C
122644  United Kingdom  VIP C

[397924 rows x 2 columns]

In [36]:
#Creating a new dataframe only for VIP customers

VIP = orders[orders["VIP"] == "VIP C "].sort_values(by = "amount_spent",ascending=False)

In [37]:
#Displaying the results

VIP.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent,VIP
397451,540421,581483,23843,2011,12,5,9,"paper craft , little birdie",80995,2011-12-09 09:15:00,2.08,16446,United Kingdom,168469.60,VIP C
37126,61619,541431,23166,2011,1,2,10,medium ceramic top storage jar,74215,2011-01-18 10:01:00,1.04,12346,United Kingdom,77183.60,VIP C
155418,222680,556444,22502,2011,6,5,15,picnic basket wicker 60 pieces,60,2011-06-10 15:28:00,649.50,15098,United Kingdom,38970.00,VIP C
118352,173382,551697,POST,2011,5,2,13,postage,1,2011-05-03 13:46:00,8142.75,16029,United Kingdom,8142.75,VIP C
248706,348325,567423,23243,2011,9,2,11,set of tea coffee sugar tins pantry,1412,2011-09-20 11:05:00,5.06,17450,United Kingdom,7144.72,VIP C

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [38]:
# Displaying the number of total orders by country

orders["Country"].value_counts()

United Kingdom          354345
Germany                   9042
France                    8342
EIRE                      7238
Spain                     2485
Netherlands               2363
Belgium                   2031
Switzerland               1842
Portugal                  1462
Australia                 1185
Norway                    1072
Italy                      758
Channel Islands            748
Finland                    685
Cyprus                     614
Sweden                     451
Austria                    398
Denmark                    380
Poland                     330
Japan                      321
Israel                     248
Unspecified                244
Singapore                  222
Iceland                    182
USA                        179
Canada                     151
Greece                     145
Malta                      112
United Arab Emirates        68
European Community          60
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              25
Bahrain                     17
Saudi Arabia                 9
Name: Country, dtype: int64

In [39]:
#Finding the country which has the most VIP customers = UK

VIP["Country"].value_counts()

United Kingdom          14739
Netherlands              1468
EIRE                      715
Australia                 571
Germany                   511
France                    393
Switzerland               179
Sweden                    177
Japan                     172
Spain                     129
Norway                    114
Finland                    62
Denmark                    62
Portugal                   41
Singapore                  41
Belgium                    39
Channel Islands            31
Israel                     28
Austria                    27
Cyprus                     24
Greece                     20
Italy                      19
Poland                     10
Lithuania                   7
Iceland                     7
Lebanon                     6
USA                         4
Malta                       4
United Arab Emirates        4
Brazil                      3
Canada                      3
Bahrain                     2
Unspecified                 2
Czech Republic              1
Name: Country, dtype: int64

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [40]:
#Labelling all the VIP and Prefered customers in only one category ("VIP+Prefered")

orders['VIP'] = list(map(lambda x: "VIP+Prefered" if ( (" C ") in x ) else x, orders['VIP']))

In [41]:
#Checking the results

orders['VIP'].value_counts()

VIP+Prefered    89622
p70             27753
p55             27279
p15             24803
p30             23841
p0              22880
p60             20381
p25             20264
p45             19906
p50             19856
p40             19248
p10             18575
p5              18241
p35             16184
p20             15170
p65             13921
Name: VIP, dtype: int64

In [42]:
#Creating a new dataframe for all the VIP and prefered customers and checking the values by country (again UK)

totalVIP = orders[orders["VIP"] == "VIP+Prefered"].sort_values(by = "amount_spent",ascending=False)

totalVIP["Country"].value_counts()

United Kingdom          72944
Germany                  2893
France                   2736
EIRE                     2662
Netherlands              1927
Australia                 843
Switzerland               771
Spain                     599
Belgium                   581
Norway                    503
Portugal                  446
Channel Islands           299
Finland                   277
Sweden                    270
Italy                     266
Japan                     241
Denmark                   217
Cyprus                    194
Singapore                 154
Israel                    118
Austria                   118
Poland                    112
Iceland                    67
USA                        60
Greece                     48
Unspecified                36
United Arab Emirates       36
Canada                     33
Malta                      30
Lithuania                  27
Lebanon                    27
European Community         23
Czech Republic             20
RSA                        18
Brazil                     15
Bahrain                    11
Name: Country, dtype: int64